In [ ]:
==========================EDA================
1) Pandas : Data frame Application
2) Numpy  : Numerical python All math application
3) matplotlib : used for plotting
4) seaborn : used for plot
5) plotly  : used for plot
6) Bokhe   : used for plot
======================Machine Learning======
    7) Sickit-learn : sklearn
======================Deep Learning========
8) tensorflow  :  Google
9) Keras       
10) Pytorch
  :Google
  :Facebook
======================NLP==============
11) NLTK : Natural language tool kit
12)scipy
======================BERT=============
13) Transformers : Hugging face (google)

==================Goggle Model=========
14) Specific Google packages

==================Azure ML==============
    15) Azure Packages
====================GenAI================
16) Gemini : Google
17) chatgpt : openAi

===================Langchain=====================
18) LangChain pacakages

**Create a Data Frame using List**

In [4]:
name=['Akash','Aniket','yash']
name

['Akash', 'Aniket', 'yash']

In [5]:
#import pandas library/package
import pandas as pd

In [6]:
#create a DataFrame
name=['Akash','Aniket','yash']
pd.DataFrame(name)

        0
0   Akash
1  Aniket
2    yash

In [7]:
name=['Akash','Aniket','Yash']
age=[20,25,22]
pd.DataFrame(name,age)
#what is first positional argument: Data
#second positional argument is : index

         0
20   Akash
25  Aniket
22    Yash

In [8]:
#To avoid the above problem we use zip function
name=['Akash','Aniket','Yash']
age=[20,25,22]
pd.DataFrame(zip(name,age))

        0   1
0   Akash  20
1  Aniket  25
2    Yash  22

In [9]:
name=['Akash','Aniket','yash']
age=[20,25,22]
city=['Latur','Solapur','Pune']
pd.DataFrame(zip(name,age,city))

        0   1        2
0   Akash  20    Latur
1  Aniket  25  Solapur
2    yash  22     Pune

In [10]:
name=['Akash','Aniket','Ajay']
age=[20,22,25]
city=['Latur','Solapur','Pune']
data=zip(name,age)
pd.DataFrame(data,city)

              0   1
Latur     Akash  20
Solapur  Aniket  22
Pune       Ajay  25

In [11]:
name=['Akash','Aniket','Ajay']
age=[20,22,25]
city=['Latur','Solapur','Pune']
pd.DataFrame(zip(name,age))

        0   1
0   Akash  20
1  Aniket  22
2    Ajay  25

**Providing Column Name**

In [12]:
name=['Akash','Aniket','Ajay']
age=[20,22,25]
city=['Latur','Solapur','Pune']
pd.DataFrame(zip(name,age),columns=['Name','Age'])

     Name  Age
0   Akash   20
1  Aniket   22
2    Ajay   25

In [13]:
name=['Akash','Aniket','Ajay']
age=[20,22,25]
city=['Latur','Solapur','Pune']
pd.DataFrame(zip(name,age),city,columns=['Name','Age'])

           Name  Age
Latur     Akash   20
Solapur  Aniket   22
Pune       Ajay   25

In [14]:
name=['Akash','Aniket','Ajay']
age=[20,22,25]
city=['Latur','Solapur','Pune']
s_data=pd.DataFrame(zip(name,age),city,columns=['Name','Age'])

**type**

In [15]:
type(s_data)

pandas.core.frame.DataFrame

**ADD New Column**
- if you want to add new column
- First you need to check the number of rows in already exited data
- For Example in above the dataframe has 3 rows
- You need to create a new list with 3 rows
- that list equate to the dataframe

In [16]:
#step1 : check no of rows
s_data

           Name  Age
Latur     Akash   20
Solapur  Aniket   22
Pune       Ajay   25

In [17]:
#step2 : creeate a list contaning same items as in table
gen=['m','m','m']
gen

['m', 'm', 'm']

In [18]:
#To add a new column
#DF_name[col_name]=list_name
s_data['gen']=gen
s_data

           Name  Age gen
Latur     Akash   20   m
Solapur  Aniket   22   m
Pune       Ajay   25   m

In [19]:
s_data['ge']=gen
s_data

           Name  Age gen ge
Latur     Akash   20   m  m
Solapur  Aniket   22   m  m
Pune       Ajay   25   m  m

**update the already Existed Column**
- create a new column and update new column both are same way

In [20]:
s_data['Age']=[34,56,22]
s_data

           Name  Age gen ge
Latur     Akash   34   m  m
Solapur  Aniket   56   m  m
Pune       Ajay   22   m  m

**Drop the column(.drop)**
- In order to drop column we required 3 arguments
- Column name
- The column name we need to mention
- axis
-  - axis=0 represents rows
   - axis=1 represents columns
- inplace
-  - we are drop column means we are modifying the data frame
   - so this modification we want to save in same variable or different variable
   - if you want to keep in the same variable the inplace=True
   - if you want to keep in the another variable the inplace=False

In [21]:
s_data.drop('ge',
           axis=1,
           inplace=True)
s_data

           Name  Age gen
Latur     Akash   34   m
Solapur  Aniket   56   m
Pune       Ajay   22   m

**change the index**

In [22]:
import pandas as pd
names=['Akash','Avinash','Akash','Anvi']
age=[23,33,35,40]
city=['HYD','BLR','MUMBAI','PUNE']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
               index=idx,
               columns=cols)
df

     Names  Age    City
A    Akash   23     HYD
B  Avinash   33     BLR
C    Akash   35  MUMBAI
D     Anvi   40    PUNE

**Note**
- Number of list equals to Number of Columns
- Number of values inside list equals to Number of rows
- when you create the data all the lists will be in same length

In [23]:
import pandas as pd
names=['Akash','Avinash','Akash','Anvi']
age=[23,33,35,]
city=['HYD','BLR','MUMBAI','PUNE']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
               index=idx,
               columns=cols)
df

ValueError: Length of values (3) does not match length of index (4)

**Shape**
- Number of Rows
- Number of Columns

In [25]:
df.shape
#Matrix format
# 4 rows and 3 columns
print("The Number of Rows are:",df.shape[0])
print("The Number of Columns are: ",df.shape[1])

The Number of Rows are: 4
The Number of Columns are:  3

**Drop the Column**
- In order to drop column we required 3 arguments
- column name
  - The column name we need to mention
- axis
  - axis= 0 represents rows
  - axis= 1 represents columns
- inplace
  - we are drop column means we modifying the data frame
  - so this modification we want to save in same variables or different variable
  - If you want to keep in the same variable the inplace=True

In [36]:
df['City']=['HYD','PUNE','LATUR','BLR']
df

     Names  Age   City
A    Akash   23    HYD
B  Avinash   33   PUNE
C    Akash   35  LATUR
D     Anvi   40    BLR

In [41]:
df.drop('City',
       axis=1,
       inplace=False)

     Names  Age
A    Akash   23
B  Avinash   33
C    Akash   35
D     Anvi   40

In [39]:
df1=df.drop('Age',axis=1) # do not give inplace=True

In [42]:
df

     Names  Age   City
A    Akash   23    HYD
B  Avinash   33   PUNE
C    Akash   35  LATUR
D     Anvi   40    BLR

In [43]:
df1

     Names   City
A    Akash    HYD
B  Avinash   PUNE
C    Akash  LATUR
D     Anvi    BLR

In [50]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['Hyd','Blr','Chn','Pune']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,columns=cols,index=idx)
df

     Names  Age  City
A    Ayush   25   Hyd
B  Avinash   30   Blr
C    Akash   35   Chn
D     Anvi   40  Pune

In [51]:
df.drop('City',axis=1,inplace=True)

In [52]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [53]:
df.drop('Age',axis=1)

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

**Multiple column drop**

In [1]:
#again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['Hyd','Blr','Chn','Pune']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,columns=cols,index=idx)
df

     Names  Age  City
A    Ayush   25   Hyd
B  Avinash   30   Blr
C    Akash   35   Chn
D     Anvi   40  Pune

In [2]:
df.drop(['Age','City'],axis=1,inplace=True)

In [3]:
df

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

**Drop the Rows**

In [4]:
#again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['Hyd','Blr','Chn','Pune']
data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,columns=cols,index=idx)
df

     Names  Age  City
A    Ayush   25   Hyd
B  Avinash   30   Blr
C    Akash   35   Chn
D     Anvi   40  Pune

In [5]:
df.drop('A',axis=0,inplace=True)
df

     Names  Age  City
B  Avinash   30   Blr
C    Akash   35   Chn
D     Anvi   40  Pune

**How to save the data frame**
- Generally data frames are two types
- csv(common seperated value)
- excel

In [6]:
df

     Names  Age  City
B  Avinash   30   Blr
C    Akash   35   Chn
D     Anvi   40  Pune

In [7]:
#file name=data
#extension=.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [8]:
#Extension
#.xlsx
df.to_excel("data2.xlsx",index=False)

In [11]:
name=['Ayush','Avinash','Akash','Aniket']
age=[20,45,32,34]
city=['Latur','pune','Blr','Hyd']
country=['India','India','India','India']
data=zip(name,age,city,country)
cols=['Names','Age','City','Country']
idx=['A','B','C','D']
df_bhavesh=pd.DataFrame(data,columns=cols,index=idx)
df_bhavesh

     Names  Age   City Country
A    Ayush   20  Latur   India
B  Avinash   45   pune   India
C    Akash   32    Blr   India
D   Aniket   34    Hyd   India

In [12]:
df_bhavesh.drop('A',axis=0,inplace=True)
df_bhavesh

     Names  Age  City Country
B  Avinash   45  pune   India
C    Akash   32   Blr   India
D   Aniket   34   Hyd   India